print ('напиши камень ножницы или бумага. Только с маленькой буквы!')
x = input().lower() # можно использовать функцию .lower() которая автоматически делает весь текст маленький: Камеёнь -> камень
                    # данная функция доступна только для строк, и для функций, которые возвращают строку

if x == 'камень' :  
    print ('бумага, ты проиграл')
    # в Python рекомендуется использовать 4 пробела вместо таба. табы можно, но не все редакторы могут понять такое, и порекомендуют тебе придерживаться стандарта
    # а особенно если ты захочешь потом отредактировтаь данный код в другом редакторе - то там могут быть по умолчанию пробелы, а одновременно пробелы и табы использовать запрещено

elif x == 'ножницы' :
    print ('камень, ты проиграл')

elif x == 'бумага' :
    print ('ножницы, ты проиграл')

else:
    print ("я как понимаю условие ты не читал(а)?")

# так же я добавил расширение к твоему файлу и сделал его с маленькой буквы, потому что это база. ко всем Python скриптам надо добавлять .py в конце если этого нету
